Tekla Open API Reference for Tekla Structures 2025
WeldMark.SeamVisibilityAttributes.ShowAngle Property
 Gets or sets a value indicating whether the seam angle is visible.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ShowAngle { get; set; }
Public Property ShowAngle As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
WeldMark.SeamVisibilityAttributes Class
Tekla.Structures.Drawing Namespace